// შედეგის გამოტანა კონსოლში
// ეს ნაწილი არის ჩვენთვის რათა შედეგი დავინახოთ და შევამოწმოთ
// კონსოლოს სივრცეს ვხსნით ბრაუზერში ინსპექტში Elemsnts _ების
// გვერდით Console სივრცეში

console.log("Hello, JavaScript");

// html დოკუმენტში შედეგის დაბეჭდვა
// document.write("Hello, JavaScript ");

// ალერტ მეთოდს გამოყენების მაგალითი
// გვაფრთხილებს კონკრეტული შედეგის შესახებ
// შეგვიძლია გავაფრთხილოთ მომხმარებელი ან ინფორმცია მივაწოდოთ

// alert("This is Lesson 1");

// ქონფირმ მეთოდის გამყენების მაგალითი
// შეგვიძია მომხმარებელი დავითანხმოთ ან უარი ვანთქმევინოთ

// confirm("Do you want to delete this account?");

// პრომპტ მეთოდის გამოყენების მაგალითი
// შეგვიძია მომხმარებელს შემოვატანინოთ ინფორმაცია

// prompt("how old are you?");

//  ცვლადის შექმნა let ის დახმარებით
let firstName = "Tevdore";
console.log(firstName);

// let age = prompt("რამდენი წლის ხარ ?");
// console.log(age);

// ცვლადის სექმნა var ის დახმარეით
var lastName = "Khintibidze";

// ცვლადის შექმნა const ის დახმარებით
const email = "tkhintibidze@itvet.ge";

// ცვლადზე მნიშვნელობის შეცვლა
lastName = "Gamsakhurdia";
console.log(lastName);

// const ით შექმნილ ცვლადს მნისვნელობას ვერ შევუცვლით
// email = "test@gmail.com";

// ცვლადების ტიპები (მონაცემტა ტიპები)

// string ტიპის ჩანაწერი
let city = "Tbilisi";
console.log(typeof city);

// number ტიპის ჩანაწერი
let year = 2026;
console.log(typeof year);

// boolean ტიპის ჩანაწერი
let isStudent = true;
console.log(typeof isStudent);

// მათემატიკური ოპერატორები
console.log(12 + 8);
console.log(2026 - 1995);
console.log(7 * 8);
console.log(40 / 4);
// ნაშთიანი გაყოფა ვიბრუნებს ნაშთს
console.log(13 % 2);

// ხარისხში აყვანა
console.log(2 ** 3);

// სტრინგების გადაბმა (კონკატენაცია)

let userName = "მარიამი";
console.log("მე ვარ" + " " + userName);

// დავალება 1
// ფრომპტის დახმარებიტ კითხეთ იუზერს რა ქვია
// და კონსოლ ლოგში მიესალმეტ იუზერს
// მაგალითად "გამარჯობა დავით"

// let userName1 = prompt("what is your name");
// console.log("Hello " + userName1);
// // html დოკუმენტში შედეგის დაბეჭდვა
// document.write("Hello " + userName1);

// პრომპტიტ შემოტანილი მონაცემი არის სტრინგული ტიპის
let userAge = prompt("How old are you");
console.log(typeof userAge);

// სტრინგული ჩანაწერი გადაკეთება ნამბერის ტიპად
// მაგალითი 1
console.log(typeof +userAge);

//მაგალითი 2
console.log(typeof Number(userAge));

// დავალება 2
// შექმენით ცვლადი სახელად carName , მიანიჭეთ სტრინგული
// მნიშვნელობა და კონსოლში დაბეჭდეთ ცვლადი

// დავალება 3
// შექმენით ცვლადი სახელად carModel, მიანიჭეთ სტრინგული ტიპის
//ჩანაწერი და  alert() ის დახმარებით გამოიტანეთ შედეგი ბრაუზერში

// დავალება 4
// prompt() ის დახმარებით მომხმარებელს შემოაყვანინეთ მანქანის
// წელი ,  კითხეთ რომელ წელს გამოშვებული მანქანა სურს ,
// და ალერთში გამოიტანეთ თუ რამდენი წლის არის ეს მანქანა
// მაგ: თქვენს მიერ არჩეული მანქანა არის X  წლის

// დაველაბ 5
// გვაქვს ორი ცვლადი num1 = 300, num2 = 888;
// მხოლოდ მათემატიკური ოპერატორების დახმარებით
// გადაუნაცვლეთ მნიშვნელობები ცვლადებს ისე რომ კონსოლში
// num1 ის დაბეჭდვისას გამოქონდეს   888 და num2 ის დაბეჭდვისას
// გამოქონდეს 300
// არ შექმნათ ახალი ცვლადი მაგ: num3
// პირდაპირ მნიშვნელობის მინიჭება არ შეგვიძლია მაგ: num2 = 300, num1 = 800
// სახელების გადარქმეა არ შეგვიძლია
